#+STARTUP: inlineimages
*** Ejemplo 2 - Definir una función arimética que recibe un parámetro
  #+BEGIN_SRC elisp :exports both
    (defun multiplicar-por-siete (numero)
      "Esto es un comentario, y describimos que multiplica a `numero' por siete"
      (* 7 numero))

    (multiplicar-por-siete 3)
  #+END_SRC

  #+RESULTS:
  : 21
*** Ejemplo 3 - Parámetros de una función usados por otras funciones invocadas en ese scope
  #+BEGIN_SRC elisp
    (defun a-exists-only-in-my-body (a)
      (other-function))

    (defun other-function ()
      (message "I see `a', its value is %s" a))

    (a-exists-only-in-my-body 5)
  #+END_SRC

  #+RESULTS:
  : I see ‘a’, its value is 5
*** Ejemplo 4 - Definir la Función Recursiva Factorial
  #+BEGIN_SRC elisp :exports both
    ;; - Definimos una función recursiva porque se llama a si misma
    ;; - Caso base: Si n es cero, se corta la recursividad
    ;; - Caso recursivo: Si n no es cero, multiplica n veces el valor por valor-1
    (defun factorial (n)
      (if (= n 0)
          1
        (* n (factorial (- n 1)))))

    (factorial 5)
  #+END_SRC

  #+RESULTS:
  : 120

*** Ejemplo 1 - Obtener la ruta absoluta del buffer
  #+BEGIN_SRC elisp
    (buffer-file-name)
  #+END_SRC

  #+RESULTS:
  : /home/jelou/Documentos/git/aprende-elisp/test1.org
*** Ejemplo 2 - Obtener el nombre del buffer y su extensión
  #+BEGIN_SRC elisp
    (buffer-name)
  #+END_SRC

  #+RESULTS:
  : test1.org
*** Ejemplo 3 - Obtener el tamaño del buffer
  #+BEGIN_SRC elisp
    (buffer-size)
  #+END_SRC

  #+RESULTS:
  : 4953
*** Ejemplo 2 - Concatenar resultados de funciones
  #+BEGIN_SRC elisp
    ;; pasamos funciones como argumentos
    ;; el (+ 1 2) es similar a haskell
    (concat "hola " (number-to-string (+ 1 2)) " xd")
  #+END_SRC

  #+RESULTS:
  : hola 3 xd
*** Ejemplo 1 - Imprimir un hola-mundo
  #+BEGIN_SRC elisp :exports both
    ;; funciona como un echo o print
    (message "hola mundo")
  #+END_SRC

  #+RESULTS:
  : hola mundo
*** Ejemplo 2 - Pasar argumentos y mostrarlos con especificadores de formato
  #+BEGIN_SRC elisp :exports both
    ;; usamos el %s como especificador de formato que representa un string
    (message "el nombre del buffer es %s" (buffer-name))
  #+END_SRC

  #+RESULTS:
  : el nombre del buffer es README.org
*** Ejemplo 3 - Pasar argumentos y mostrarlos con especificadores de formato
  #+BEGIN_SRC elisp
    ;; - es un formato similar al printf de C
    ;; - usamos los %s y %d como especificadores de formato
    ;; - %s para los literales cadena (string)
    ;; - %d para las constantes numéricas enteras
    (message "el nombre de buffer es %s y 100+100 es %d" (buffer-name) (+ 100 100))
  #+END_SRC

  #+RESULTS:
  : el nombre de buffer es README.org y 100+100 es 200
